# SetVisibility Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
GenericForm..::..SetVisibility Method
GenericForm Class See Also
---
Sets the visibility for the generic form.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetVisibility(
	FamilyElementVisibility visibility
)
```

Visual Basic
---
```text
Public Sub SetVisibility ( _
	visibility As FamilyElementVisibility _
)
```

Visual C++
---
```text
public:
void SetVisibility(
	FamilyElementVisibility^ visibility
)
```

# ### Parameters
visibility
    Type: Autodesk.Revit.DB..::..FamilyElementVisibility
# Remarks
The visibility of the generic form geometry can be changed for different types of views and detail levels in the project.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when visibility is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when regeneration failed. |

# See Also
GenericForm Class
Autodesk.Revit.DB Namespace